package com.example.administrator.personhealthrecord.bean;

import com.google.gson.annotations.SerializedName;

/**
 * Created by Administrator on 2017-7-25.
 */

public class DiseaseBean {

    /**
     * id : 1
     * name : 癌症
     * summary : 在医学上，癌是指起源于上皮组织的恶性肿瘤，是恶性肿瘤中最常见的一类。相对应的，起源于间叶组织的恶性肿瘤统称为肉瘤。有少数恶性肿瘤不按上述原则命名，如肾母细胞瘤、恶性畸胎瘤等。一般人们所说的“癌症”习惯上泛指所有恶性肿瘤。 肿瘤是机体在各种致瘤因素作用下，局部组织的细胞在基因水平上失去对其生长的正常调控导致异常增生与分化而形成的新生物。新生物一旦形成，不因病因消除而停止生长，他的生长不受正常机体生理调节，而是破坏正常组织与器官，这一点在恶性肿瘤尤其明显。与良性肿瘤相比，恶性肿瘤生长速度快，呈浸润性生长，易发生出血、坏死、溃疡等，并常有远处转移，造成人体消瘦、无力、贫血、食欲不振、发热以及严重的脏器功能受损等，最终造成患者死亡。
     * pathogeny : 恶性肿瘤的病因尚未完全了解。多年的流行病学研究及实验和临床观察，发现环境与行为对人类恶性肿瘤的发生有重要影响。据估计约80%以上的恶性肿瘤与环境因素有关。各种环境的和遗传的致癌因素可能以协同或序贯的方式引起细胞非致死性的DNA损害，从而激活原癌基因或（和）灭活肿瘤的抑制基因，加上凋亡调节基因和（或）DNA修复基因的改变，使细胞发生转化。被转化的细胞可先呈多克隆性增生，经过一个漫长的多阶段演进过程，其中某个克隆相对无限制扩增，通过附加突变，选择性形成不同特点的亚克隆，从而获得浸润和转移能力，形成恶性肿瘤。因此，肿瘤从本质上来说是一种基因病。 1.外界因素 （1）化学因素：如烷化剂、多环芳香烃类化合物、氨基偶氮类、亚硝胺类、真菌毒素和植物毒素等，可诱发肺癌、皮肤癌、膀胱癌、肝癌、食管癌和胃癌等。 （2）物理因素：电离辐射，如X线可引起皮肤癌、白血病等，紫外线可引起皮肤癌，石棉纤维与肺癌有关，滑石粉与胃癌有关，烧伤深瘢痕和皮肤慢性溃疡均可能发生癌变等。 （3）生物因素：主要为病毒，其中1/3为DNA病毒，2/3为RNA病毒。DNA病毒如EB病毒与鼻咽癌、伯基特淋巴瘤有关，人类乳头状病毒感染与宫颈癌有关，乙型肝炎病毒与肝癌有关。RNA病毒如T细胞白血病/淋巴瘤病毒与T细胞白血病/淋巴瘤有关。此外，幽门螺杆菌感染与胃癌发生也有关系。 2.内在因素 （1）遗传因素：真正直接遗传的肿瘤只是少数不常见的肿瘤，遗传因素在大多数肿瘤发生中的作用是增加了机体发生肿瘤的倾向性和对致癌因子的易感性，如结肠息肉病、乳腺癌、胃癌等。 （2）免疫因素：先天性或后天性免疫缺陷易发生恶性肿瘤，如丙种蛋白缺乏症患者易患白血病和淋巴造血系统肿瘤，肾移植后长期应用免疫抑制剂的患者，肿瘤发生率较高，但大多数恶性肿瘤发生于免疫机能“正常”的人群，主要原因在于肿瘤能逃脱免疫系统的监视并破坏机体免疫系统，机制尚不完全清楚。 （3）内分泌因素：如雌激素和催乳素与乳腺癌有关，生长激素可以刺激癌的发展。
     * category :
     * clinicalManifestation : 恶性肿瘤的的临床表现因其所在的器官、部位以及发展程度不同而不同，但恶性肿瘤肿瘤早期多无明显症状，即便有症状也常无特征性，等患者出现特征性症状时，肿瘤常已经属于晚期。一般将癌症的临床表现分为局部表现和全身性症状两个方面。 1.癌症的局部表现 （1）肿块：癌细胞恶性增殖所形成的，可用手在体表或深部触摸到。甲状腺、腮腺或乳腺的癌可在皮下较浅部位触摸到。肿瘤转移到淋巴结，可导致淋巴结肿大，某些表浅淋巴结，如颈部淋巴结和腋窝淋巴结容易触摸到。至于在身体较深部位的胃癌、胰腺癌等，则要用力按压才可触到。恶性肿瘤包括癌的肿块生长迅速，表面不平滑，不易推动；良性肿瘤则一般表面平滑，像鸡蛋和乒乓球一样容易滑动。肺部等胸腔器官无法直接触摸到，但在胸片或CT上可以看到相应的肿块，或在锁骨上等部位触摸到转移的淋巴结肿块。 （2）疼痛：肿瘤的膨胀性生长或破溃、感染等使末梢神经或神经干受刺激或压迫，可出现局部疼痛。出现疼痛往往提示癌症已进入中、晚期。开始多为隐痛或钝痛，夜间明显。以后逐渐加重，变得难以忍受，昼夜不停，尤以夜间明显。一般止痛药效果差。 （3）溃疡：体表或胃肠道的肿瘤，若生长过快，可因供血不足出现组织坏死或因继发感染而形成溃烂。如某些乳腺癌可在乳房处出现火山口样或菜花样溃疡，分泌血性分泌物，并发感染时可有恶臭味。胃、结肠癌形成的溃疡一般只有通过胃镜、结肠镜才可观察到。 （4）出血：癌组织侵犯血管或癌组织小血管破裂而产生。如肺癌患者可咯血或痰中带血；胃癌、食管癌、结肠癌则可呕血或便血，泌尿道肿瘤可出现血尿，子宫颈癌可有阴道流血，肝癌破裂可引起腹腔内出血。 （5）梗阻：癌组织迅速生长而造成空腔脏器的梗阻。当梗阻部位在呼吸道即可发生呼吸困难、肺不张；食管癌梗阻食管则吞咽困难；胆道部位的癌可以阻塞胆总管而发生黄疸；膀胱癌阻塞尿道而出现排尿困难等；胃癌伴幽门梗阻可引起餐后上腹饱胀、呕吐等。总之，因癌症所梗阻的部位不同而出现不同的症状。 （6）其他：颅内肿瘤可引起视力障碍（压迫视神经）、面瘫（压迫面神经）等多种神经系统症状；骨肿瘤侵犯骨骼可导致骨折；肝癌引起血浆白蛋白减少而致腹水等。肿瘤转移可以出现相应的症状，如区域淋巴结肿大，肺癌胸膜转移引起的癌性胸水等。 2.全身症状 早期恶性肿瘤多无明显全身症状。恶性肿瘤患者常见的非特异性全身症状有体重减轻、食欲不振、恶病质、大量出汗（夜间盗汗）、贫血、乏力等。恶病质常是恶性肿瘤晚期全身衰竭的表现，不同部位肿瘤，恶病质出现早晚不一样，一般消化道肿瘤者可较早发生。 某些部位的肿瘤可呈现相应的功能亢进或低下，继发全身性改变，如肾上腺嗜铬细胞瘤引起高血压，甲状旁腺腺瘤引起骨质改变等。 此外，有些肿瘤如肺癌，由于产生内分泌物质，产生与转移、消耗无关的全身症状，即副肿瘤综合征等，表现为肺性骨关节病、Cushing综合征、Lambert-Eaton综合征、异位ADH分泌综合征等。
     * checkUp : 1.实验室检查 （1）常规检查：包括血、尿、粪常规检查。白血病患者血象可明显改变；泌尿系统肿瘤可出现血尿；多发性骨髓瘤尿中可出现Bence-Jones蛋白；消化道肿瘤可出现便血或大便潜血，并伴有贫血。这些检查有时并非特异性，但常为临床提供有价值的诊断线索。 （2）血清学检查：主要是用生化方法测定肿瘤细胞产生的肿瘤标志物，这些标志物可以是酶、激素、糖蛋白、胚胎性抗原或肿瘤代谢产物，大多数肿瘤标志物在恶性肿瘤和正常组织之间并无质的差别，仅为量的差别，故特异性较差，但可以作为辅助诊断，对疗效判断和随访具有一定价值。 这些检查主要包括酶学检查，如碱性磷酸酶，在肝癌和骨肉瘤患者可明显升高；糖蛋白，如肺癌血清ɑ酸性糖蛋白可有升高，消化系统肿瘤CA19-9等增高；肿瘤相关抗原，如癌胚抗原（CEA）在胃肠道肿瘤、肺癌、乳腺癌中可出现增高，甲胎蛋白（AFP）在肝癌和恶性畸胎瘤中可增高。 （3）流式细胞分析术：用以了解肿瘤细胞分化的一种分化，分析染色体DNA倍体类型、DNA指数等，结合肿瘤的病理类型用以判断肿瘤恶性程度及推测预后。 （4）基因或基因产物检查：核酸中碱基排列具有严格的特异序列，基因诊断即利用此特征确定是否有肿瘤或癌变的特定基因存在，从而做出诊断。 2.影像学和内镜检查 （1）X线检查：包括透视与平片，如部分外周性肺癌、骨肿瘤可以在平片上出现特定的阴影；造影检查，如上消化道造影可能发现食管癌、胃癌等，钡灌肠可以显示结肠癌等；特殊X线显影术，如钼靶摄影用于乳腺癌的检查。 （2）超声检查：简单、无创，广泛用于肝、胆、胰、脾、肾、甲状腺、乳腺等部位的检查，并可在超声引导下进行肿物的穿刺活检，成功率较高。 （3）计算机断层扫描（CT）检查：常用于颅内肿瘤、实质性脏器肿瘤、实质性肿块及淋巴结等的诊断与鉴别诊断。CT检查分辨率高，显像清楚，可以在无症状情况下发现某些特定器官的早期肿瘤。低剂量螺旋CT可以降低对人体的放射线照射剂量，而图像清晰程度也能满足临床需求，从而可以实现对某些特定部位肿瘤的高危人群进行大面积筛查，如肺癌的早期筛查，已经取得了良好的效果。 （4）放射性核素显像：根据不同肿瘤对不同元素的摄取不同，应用不同的放射性核素对肿瘤进行显像。对骨肿瘤诊断的阳性率较高，还可用于显示甲状腺肿瘤、肝肿瘤、脑肿瘤等。 （5）磁共振（MRI）：利用人体氢原子核中的质子在强大磁场下激发氢质子共振，产生电磁波被接收线圈接受并作空间定位，形成人体组织的生理或病理MRI图像，以供临床诊断，尤其对神经系统及软组织显像尤为清晰。 （6）正电子发射断层显像（PET）：以正电子核素标记为示踪剂，通过正电子产生的γ光子，重建出示踪剂在体内的断层图像，是一项能够反映组织代谢水平的显像技术，对实体肿瘤的定性诊断和转移灶的检查准确率较高。 （7）内镜检查：是应用腔镜和内镜技术直接观察空腔脏器和体腔内的肿瘤或其他病变，并可取组织或细胞进行组织病理学诊断，常用的有胃镜、支气管镜、结肠镜、直肠镜、腹腔镜、胸腔镜、子宫镜、阴道镜、膀胱镜、输尿管镜等。 3.细胞病理学检查 细胞病理学检查为目前具有确诊意义的检查手段。 （1）临床细胞学检查：包括体液自然脱落细胞检查，如痰液、尿液沉渣、胸腔积液、腹腔积液的细胞学检查以及阴道涂片检查等；黏膜细胞检查，如食管拉网、胃黏膜洗脱液、宫颈刮片以及内镜下肿瘤表面刷脱细胞；细针吸取细胞检查，如用针和注射器吸取肿瘤细胞进行涂片染色检查等。细胞学检查取材简单，应用广泛，但多数情况下仅能做出细胞学定性诊断，有时诊断困难。 （2）病理组织学检查：根据肿瘤所在不同部位、大小、性质而采取不同的取材方法。 1）穿刺活检：应用专门的活检针在局麻下获取小的组织块进行组织学诊断。缺点是有可能造成肿瘤的针道转移或严重出血，应严格掌握适应证。 2）钳取活检：用于体表或空腔脏器黏膜的表浅肿瘤，多在内镜检查时获取组织进行病理学检查。 3）手术切除肿瘤活检或切取部分肿瘤组织进行病理学检查，对色素性结节或痣一般不做切取或穿刺活检，应该完整切除检查。 各类活检均有促使恶性肿瘤扩散的潜在可能性，需要在术前短期内或术中施行。
     * diagnosis : 根据肿瘤发生的不同部位和性质，对患者的临床表现和体征进行综合分析，结合实验室检查和影像学、细胞病理学检查通常能做出明确诊断。 对恶性肿瘤的分期有助于合理制定治疗方案，正确的评价疗效和判断治疗预后。国际抗癌联盟提出的TNM分期法是目前广泛采用的分期方法。 TNM分期系统中 T分期（Tumor）代表肿瘤的发展程度可分： TX无法找到原发性肿瘤或定义分期； T0没有原发性肿瘤的存在； Tis原位癌； T1-T4根据肿瘤大小及生长扩散情形； N分期（LymphNode）表示依照淋巴结受到的影响情况分成： NX无法确定淋巴结影响分期； N0无局部淋巴结转移的癌细胞； N1-N3淋巴结转移的情形； M分期（Migration）则是根据远端转移的情形分成： MX无法确定远端转移的分期； M0没有远端转移发生； M1已产生远端转移； 不同的T、N、M组合诊断为不同的期别，各种肿瘤的TNM分期标准由各专业会议协定。
     * differential : 根据不同部位的肿瘤所应鉴别的疾病也不相同，如肺癌需要和肺结核、结节病、肺部良性肿瘤等疾病相鉴别。
     * treatment : 1.手术治疗 理论上，若是以手术完全移除肿瘤细胞，癌症是可以被治愈的。对早期或较早期实体肿瘤来说，手术切除仍然是首选的治疗方法。根据手术的目的不同，可分为以下几种： （1）根治性手术：由于恶性肿瘤生长快，表面没有包膜，它和周围正常组织没有明显的界限，局部浸润明显，并可通过淋巴管转移。因此，手术要把肿瘤及其周围一定范围的正常组织和可能受侵犯的淋巴结彻底切除。这种手术适合于肿瘤范围较局限、没有远处转移、体质好的患者。 （2）姑息性手术：肿瘤范围较广，已有转移而不能作根治性手术的晚期患者，为减轻痛苦，维持营养和延长生命，可以只切除部分肿瘤或作些减轻症状的手术，如造瘘术、消化道短路等手术。 （3）减瘤手术：肿瘤体积较大或侵犯较广，不具备完全切除条件，可以做肿瘤的大部切除，降低瘤负荷，为以后的放、化疗或其他治疗奠定基础。 （4）探查性手术：对深部的内脏肿物，有时经过各种检查不能确定其性质时，需要开胸、开腹或开颅检查肿块的形态，区别其性质或切取一小块活组织快速冰冻切片检查，明确诊断后再决定手术和治疗方案，为探查性手术。 （5）预防性手术：用于癌前病变，防止其发生恶变或发展成进展期癌，如家族性结肠息肉病的患者，可以通过预防性结肠切除而获益，因这类患者若不切除结肠，40岁以后约有一半可发展成结肠癌，70岁以后几乎100%发展成结肠癌。 2.化学治疗 是用可以杀死癌细胞的药物治疗癌症。由于癌细胞与正常细胞最大的不同处在于快速的细胞分裂及生长，所以抗癌药物的作用原理通常是借由干扰细胞分裂的机制来抑制癌细胞的生长，譬如抑制DNA复制或是阻止染色体分离。多数的化疗药物都没有专一性，所以会同时杀死进行细胞分裂的正常组织细胞，因而常伤害需要进行分裂以维持正常功能的健康组织，例如肠黏膜细胞。不过这些组织通常在化疗后也能自行修复。 因为有些药品合并使用可获得更好的效果，化学疗法常常同时使用两种或以上的药物，称做“综合化学疗法”，大多数病患的化疗都是使用这样的方式进行。 化学治疗的临床应用有四种方式： （1）晚期或播散性肿瘤的全身化疗：因对这类肿瘤患者通常缺乏其他有效的治疗方法，常常一开始就采用化学治疗，近期的目的是取得缓解。通常人们将这种化疗称为诱导化疗。如开始采用的化疗方案失败，改用其他方案化疗时，称为解救治疗。 （2）辅助化疗：是指局部治疗（手术或放疗）后，针对可能存在的微小转移病灶，防止其复发转移而进行的化疗。例如骨肉瘤、睾丸肿瘤和高危的乳腺癌患者术后辅助化疗可明显改善疗效，提高生存率或无病生存率。 （3）新辅助化疗：针对临床上相对较为局限性的肿瘤，但手术切除或放射治疗有一定难度的，可在手术或放射治疗前先使用化疗。其目的是希望化疗后肿瘤缩小，从而减少切除的范围，缩小手术造成的伤残；其次化疗可抑制或消灭可能存在的微小转移，提高患者的生存率。现已证明新辅助化疗对膀胱癌、乳腺癌、喉癌、骨肉瘤及软组织肉瘤、非小细胞肺癌、食管癌及头颈部癌可以减小手术范围，或把不能手术切除的肿瘤经化疗后变成可切除的肿瘤。 （4）特殊途径化疗： 1）腔内治疗：包括癌性胸腔内、腹腔内及心包腔内积液。通常将化疗药物（如丝裂霉素、顺铂、5-氟脲嘧啶、博来霉素）用适量的流体溶解或稀释后，经引流的导管注入各种病变的体腔内，从而达到控制恶性体腔积液的目的。 2）椎管内化疗：白血病及许多实体瘤可以侵犯中枢神经系统，尤其是脑膜最容易受侵。治疗方法通常是采用胸椎穿刺鞘内给药，以便脑积液内有较高的药物浓度，从而达到治疗目的。椎管内常用的药物有甲氨喋呤及阿糖胞苷。 3）动脉插管化疗：如颈外动脉分支插管治疗头颈癌，肝动脉插管治疗原发性肝癌或肝转移癌。 3.放射线治疗 也称放疗、辐射疗法，是使用辐射线杀死癌细胞，缩小肿瘤。放射治疗可经由体外放射治疗或体内接近放射治疗。由于癌细胞的生长和分裂都较正常细胞快，借由辐射线破坏细胞的遗传物质，可阻止细胞生长或分裂，进而控制癌细胞的生长。不过放射治疗的效果仅能局限在接受照射的区域内。放射治疗的目标则是要尽可能的破坏所有癌细胞，同时尽量减少对邻近健康组织的影响。虽然辐射线照射对癌细胞和正常细胞都会造成损伤，但大多数正常细胞可从放射治疗的伤害中恢复。 肿瘤对放射敏感性的高低与肿瘤细胞的分裂速度、生长快慢成正比。同一种肿瘤的病理分化程度与放射敏感性成反比，即肿瘤细胞分化程度低则放射敏感性高，而分化程度高者则放射敏感性低。因此临床根据肿瘤对不同剂量放射线的反应不同可分为三类：一类是对放射敏感的肿瘤，常照射50～60戈瑞，肿瘤即消失，如淋巴瘤、精原细胞瘤、无性细胞瘤及低分化的鳞状上皮细胞癌、小细胞未分化型肺癌等。另一类属是中度敏感的肿瘤，要照射到60～70戈瑞左右，肿瘤才消失。再一类是对放射不敏感的肿瘤，其照射量接近甚至超过正常组织的耐受量，放射治疗的效果很差，如某些软组织肉瘤和骨的肿瘤等。肿瘤的放射敏感性还和其生长方式有关，一般向外突性生长的肿瘤如乳突型、息肉型、菜花型较为敏感，而浸润性生长的肿瘤如浸润型、溃疡型，则敏感性较低。 放射敏感性与放射治愈率并不成正比。放射敏感性的肿瘤，虽然局部疗效高，肿瘤消失快，但由于它的恶性程度大，远处转移机会多，因而难以根治。鳞状上皮癌的放射性属中等，但它的远处转移少，故放射治愈率较高，如皮肤癌、鼻咽癌、子宫颈癌。另外，对淋巴肉瘤、髓母细胞瘤等较敏感。高度敏感的有多发性骨髓瘤、精原细胞瘤，卵巢无性细胞瘤、尤文瘤、肾母细胞瘤等。高度敏感的肿瘤可以放疗为主，早期宫颈癌、鼻咽癌、舌癌、早期的食管癌等放疗的五年生存率均可达90%以上。这些癌症的晚期放疗有时也能取得一定的疗效。 4.靶向治疗 靶向治疗从90年代后期开始在治疗某些类型癌症上得到明显的效果，与化疗一样可以有效治疗癌症，但是副作用与化疗相较之下减少许多。在目前也是一个非常活跃的研究领域。这项治疗的原理是使用具有特异性对抗癌细胞的不正常或失调蛋白质的小分子，例如，酪氨酸磷酸酶抑制剂，治疗EGFR敏感突变的非小细胞肺癌，疗效显著，但耐药基因的出现是目前阻碍进一步提高疗效的主要障碍。 5.免疫疗法 免疫疗法是利用人体内的免疫机制来对抗肿瘤细胞。已经有许多对抗癌症的免疫疗法在研究中。目前较有进展的就是癌症疫苗疗法和单克隆抗体疗法，而免疫细胞疗法则是最近这几年最新发展的治疗技术。 6.中医中药治疗 配合手术、放化疗可以减轻放化疗的毒副作用，促进患者恢复，增强对放化疗的耐受力。
     * prevention : 国际抗癌联盟认为，1/3的癌症是可以预防的，1/3的癌症如能早期诊断是可以治愈的，1/3的癌症可以减轻痛苦，延长生命。据此提出了恶性肿瘤的三级预防概念： 一级预防是消除或减少可能致癌的因素，防止癌症的发生。约80%的癌症与环境和生活习惯有关，改善生活习惯，如戒烟，注意环境保护较为重要。近年来的免疫预防和化学预防均属于一级预防，如乙型肝炎疫苗的大规模接种，选择性环氧化酶2（COX-2）抑制剂对结直肠腺瘤进行化学预防等。 二级预防是指癌症一旦发生，如何在早期阶段发现并予以及时治疗。对高发区和高危人群定期检查，一方面从中发现癌前病变并及时治疗，另一方面尽可能发现较早期的恶性肿瘤进行治疗，可获得较好的治疗效果。 三级预防是治疗后的康复，提高生存质量，减轻痛苦，延长生命。包括各种姑息治疗和对症治疗。对癌痛的治疗，世界卫生组织提出三级止痛方案，基本原则为由非吗啡类药物过渡到吗啡类药物；由小剂量开始，根据止痛效果逐步增加剂量；以口服为主，无效时直肠给药，最后注射给药；定期给药。
     * imageUrl : slow_disease_1.png
     */

    /**
     * id
     */
    @SerializedName("id")
    private int id;
    /**
     * 疾病名字
     */
    @SerializedName("name")
    private String name;
    /**
     * 简要概述
     */
    @SerializedName("summary")
    private String summary;
    /**
     * 病因
     */
    @SerializedName("pathogeny")
    private String pathogeny;
    /**
     * 分类目录
     */
    @SerializedName("category")
    private String category;
    /**
     * 临床表现
     */
    @SerializedName("clinicalManifestation")
    private String clinicalManifestation;
    @SerializedName("checkUp")
    private String checkUp;
    /**
     * 诊断
     */
    @SerializedName("diagnosis")
    private String diagnosis;

    @SerializedName("differential")
    private String differential;
    /**
     * 治疗方法
     */
    @SerializedName("treatment")
    private String treatment;
    /**
     * 预防
     */
    @SerializedName("prevention")
    private String prevention;
    /**
     * 图片URL
     */
    @SerializedName("imageUrl")
    private String imageUrl;

    public int getId() {
        return id;
    }

    public void setId(int id) {
        this.id = id;
    }

    public String getName() {
        return name;
    }

    public void setName(String name) {
        this.name = name;
    }

    public String getSummary() {
        return summary;
    }

    public void setSummary(String summary) {
        this.summary = summary;
    }

    public String getPathogeny() {
        return pathogeny;
    }

    public void setPathogeny(String pathogeny) {
        this.pathogeny = pathogeny;
    }

    public String getCategory() {
        return category;
    }

    public void setCategory(String category) {
        this.category = category;
    }

    public String getClinicalManifestation() {
        return clinicalManifestation;
    }

    public void setClinicalManifestation(String clinicalManifestation) {
        this.clinicalManifestation = clinicalManifestation;
    }

    public String getCheckUp() {
        return checkUp;
    }

    public void setCheckUp(String checkUp) {
        this.checkUp = checkUp;
    }

    public String getDiagnosis() {
        return diagnosis;
    }

    public void setDiagnosis(String diagnosis) {
        this.diagnosis = diagnosis;
    }

    public String getDifferential() {
        return differential;
    }

    public void setDifferential(String differential) {
        this.differential = differential;
    }

    public String getTreatment() {
        return treatment;
    }

    public void setTreatment(String treatment) {
        this.treatment = treatment;
    }

    public String getPrevention() {
        return prevention;
    }

    public void setPrevention(String prevention) {
        this.prevention = prevention;
    }

    public String getImageUrl() {
        return imageUrl;
    }

    public void setImageUrl(String imageUrl) {
        this.imageUrl = imageUrl;
    }
}
