package com.example.administrator.personhealthrecord.mvp.healthynews;

import com.example.administrator.personhealthrecord.bean.NewsBean;

import java.util.ArrayList;
import java.util.List;

/**
 * Created by andy on 2017/7/20.
 */

public class TestDate {
    public static ArrayList<String> strings=new ArrayList<>();
    public static List<NewsBean> excute()
    {
        strings.add("7月12日的国务院常务会议上，李克强明确要求，要将已审议的《快递条例（草案）》向社会公开征求意见。在会上，总理说了这么一段话：“几年前，快递业刚刚开始发展的时候，有些城市不允许快递存在，理由是影响市容整洁，快递员骑的摩的也不允许停放。但是我们认为，对于任何新生事物，应尽量秉持‘包容审慎’的监管方式，不能一上来就‘管死’！” 　　李克强总理的这番话，安抚的不仅是快递从业者的心，也彰显了中央政府在经济新业态上的笃定姿态，提醒审慎监管的大势所趋。 　　眼下来看，“包容审慎”这四个字，说反复强调恐怕不为过。就在上个月的2017年夏季达沃斯论坛，李克强总理在特别致辞中说，“我们对新产业、新业态、新模式，比如像电子商务、移动支付、共享单车，都实行包容审慎监管方式，促进了其健康发展。”6月21日的国务院常务会议上，李克强总理举例说，“几年前微信刚出现的时候，相关方面不赞成的声音也很大，但我们还是顶住了这种声音，决定先‘看一看’再规范。如果仍沿用老办法去管制，就可能没有今天的微信了！”于此，总理要求政府部门对待各类新业态、新模式要有“包容审慎”的态度。再往前，今年两会《政府工作报告》亦曾明确提出，加快培育壮大新兴产业，本着鼓励创新、包容审慎的原则，制定新兴产业监管规则……凡此种种，不一而足。 　　“包容审慎”四字，所谓包容，就是容得下不同，眼界辽阔一些，视野宏观一点；所谓审慎，就是守得住底线，尊重新动能，了然新方位。 　　为什么要“包容审慎”？因为从辩证法来说，新事物总是难以自动匹配老规矩的。而今，《快递条例（草案）》终于向社会公开征求意见，但不得不说的是，在快递业原始生长的阶段，问题不少、矛盾也不小：野蛮分拣的众怒、禁止摩的的铿锵、恶性竞争的无序……都给消费者及社会带来了不少麻烦。不过，面对“成长中的烦恼”，自然无须“把孩子和脏水一起泼掉”。7月11日，国家邮政局发布《2017年二季度中国快递发展指数报告》。数据显示，我国上半年完成快递业务量174亿件，同比增长31.4%；实现快递业务收入约2186亿元，同比增长27.5%。在快递成为经济社会常态的时候，蓦然回首，我们会发现当初的“包容审慎”是何等紧要而关键。 　　公共决策要向新动能、新产业、新业态倾斜，这是“包容审慎”的题中之意。而即便是常规的城市管理，“包容审慎”四字仍须奉为圭臬。 　　有权切莫任性，自当“包容审慎”。（光明网评论员）");

        strings.add("会议审议通过了《关于创新体制机制推进农业绿色发展的意见》、《国家技术转移体系建设方案》、《关于深入推进公共文化机构法人治理结构改革的实施方案》、《关于加强和改进中外人文交流工作的若干意见》、《聘任制公务员管理规定（试行）》、《关于完善进出口商品质量安全风险预警和快速反应监管体系切实保护消费者权益的意见》、《关于深化审评审批制度改革鼓励药品医疗器械创新的意见》、《建立国家公园体制总体方案》、《关于健全统一司法鉴定管理体制的实施意见》。会议审议了《党的十八届三中全会以来改革试点工作进展情况报告》、《关于社会保障制度改革督察情况报告》。 　　会议指出，推进农业绿色发展是农业发展观的一场深刻革命，也是农业供给侧结构性改革的主攻方向。要正确处理农业绿色发展和生态环境保护、粮食安全、农民增收的关系，创新有利于增加绿色优质农产品供给、降低资源环境利用强度、促进农民就业增收的体制机制，形成同环境资源承载能力相匹配、生产生活生态相协调的农业发展格局，实现农业可持续发展。 　　会议强调，建立和完善国家技术转移体系，要聚焦影响长远发展的战略必争领域，遵循技术转移规律，发挥市场机制作用，加强技术供需对接，打通科技转化通道，强化联动协同，加快推动重大科技成果转化应用，更好发挥技术转移对提升科技创新能力、促进经济社会发展的重要作用。 　　会议指出，推进公共文化机构法人治理结构改革，要坚持社会主义先进文化前进方向，按照政事分开、管办分离的要求，在公共图书馆、博物馆、文化馆、科技馆、美术馆等公共文化机构推动建立以理事会为主要形式的法人治理结构，吸纳有关方面代表、专业人士、各界群众参与管理，提高公共文化机构管理水平和服务效能，增强公共文化机构活力。 　　会议强调，加强和改进中外人文交流工作，要坚定中国特色社会主义道路自信、理论自信、制度自信、文化自信，从服务国家改革发展和对外战略的大局出发，完善中外人文交流布局，创新高级别人文交流机制，改革人文交流内容、形式和工作机制，将人文交流理念贯彻到对外交往的各个领域，彰显中国特色、中国风格、中国气派，促进中外民心相通和文明互鉴。 　　会议指出，对部分专业性较强的职位实行聘任制，是完善选人用人制度、加强公务员队伍建设的一项重要制度安排。要坚持党管干部、党管人才原则，坚持德才兼备、以德为先，坚持公平、平等、竞争、择优，坚持监督约束和激励保障并重，依照法定权限、条件、标准、程序进行，提高公务员队伍专业化水平。 　　会议强调，完善进出口商品质量安全风险预警和快速反应监管体系，要把人民群众切身利益放在首位，正确处理质量安全和发展的关系，坚持安全为本、严守底线，预防为主、防控结合，创新引领、开放共享，全面加强质量安全风险监测、评估、预警、处置和管理结果运用，切实保护消费者权益。 　　会议指出，药品医疗器械质量安全和创新发展，是建设健康中国的重要保障。要改革完善审评审批制度，激发医药产业创新发展活力，改革临床试验管理，加快上市审评审批，推进仿制药质量和疗效一致性评价，完善食品药品监管体制，推动企业提高创新和研发能力，加快新药好药上市，满足临床用药急需。 　　会议强调，建立国家公园体制，要在总结试点经验基础上，坚持生态保护第一、国家代表性、全民公益性的国家公园理");


        List<NewsBean> list=new ArrayList<>();
        for(int i=0;i<8;i++)
        {
            NewsBean bean=new NewsBean();
            bean.setTime(1111);
            bean.setTitle("新闻"+i);
            bean.setSummary("新闻详情"+i);
            bean.setImageUrl("http://picapi.ooopic.com/11/54/90/22b1OOOPIC5e.jpg");
            bean.setContent(strings.get(i%2));
            list.add(bean);
        }
        return list;
    }
}
